archive/before-2018-11-10/2017-11-30-快捷键切换应用程序.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2017-11-30-快捷键切换应用程序</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2017-11-30-快捷键切换应用程序</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaa8571b">1. 安装</a></li>
<li><a href="#orgbd2e92e">2. 简单使用</a></li>
<li><a href="#org20aa6e3">3. 结合虚拟桌面使用</a></li>
</ul>
</div>
</div>
<p>
开始使用电脑时总是使用鼠标点点点来切换应用程序。后来我发现 <code>Atl+Tab</code>
可以很大的提升效率。最后我发现如果把常用应用程序绑到固定的快捷键上可以
省去更多的时间，还可以把每个程序都全屏。
</p>

<p>
在windows上有 <code>AutoHotkey</code> 。 Mac上我之前使用过 <code>karabiner</code> 。今天写一
写Linux下的 <code>wmctrl</code> 。* wmctrl来控制窗口
</p>

<div id="outline-container-orgaa8571b" class="outline-2">
<h2 id="orgaa8571b"><span class="section-number-2">1</span> 安装</h2>
<div class="outline-text-2" id="text-1">
<p>
ubuntu 16.04和Debain中可以直接使用apt来安装：
</p>
<div class="org-src-container">
<pre class="src src-sh">    sudo apt-get install wmctrl
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd2e92e" class="outline-2">
<h2 id="orgbd2e92e"><span class="section-number-2">2</span> 简单使用</h2>
<div class="outline-text-2" id="text-2">
<p>
对于wmctrl来说，它可以“看到”当前打开的所有窗口（window）。可以这样查看
一下当前所有的window：
</p>
<div class="org-src-container">
<pre class="src src-sh">wmctrl -xlG
</pre>
</div>

<p>
最简单的使用方法就是在打开对应的应用程序后，直接使用下面的命令来激活：
</p>
<div class="org-src-container">
<pre class="src src-sh">    wmctrl -a emacs
    wmctrl -a firefox
    wmctrl -a terminal
</pre>
</div>
<p>
这个是根据名字来的。我最开始的时候就直接使用的这种方法。一般Gnome，KDE
和xfce中都有设置快捷键的地方。找到对应的地方添加快捷键绑定到该脚本中即
可。
</p>
</div>
</div>

<div id="outline-container-org20aa6e3" class="outline-2">
<h2 id="org20aa6e3"><span class="section-number-2">3</span> 结合虚拟桌面使用</h2>
<div class="outline-text-2" id="text-3">
<p>
当我使用虚拟桌面时，上述设置就不太满虽我需求了。我一般每个桌面做的事
情不同，可以桌面1是在本机，桌面2可能都在远程。所以我的需求就变成了：
快捷键只能切换本桌面的窗口，不能切到其它桌面的窗口。
</p>

<p>
已经有人提过这样的 <a href="https://askubuntu.com/questions/194703/make-wmctrl-ignore-other-than-current-workspaces-windows">问题</a> 了。
</p>

<p>
最后我搞了一个这样的脚本：
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">!/bin/</span><span style="color: #a1db00;">bash</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">only switch to the application on current screen</span>

<span style="color: #ff8700;">SCREEN_W</span>=$(xwininfo -root | sed -n <span style="color: #ff4ea3;">'s/^  Width: \(.*\)$/\1/p'</span>)
<span style="color: #ff8700;">SCREEN_H</span>=$(xwininfo -root | sed -n <span style="color: #ff4ea3;">'s/^  Height: \(.*\)$/\1/p'</span>)

<span style="color: #ff8700;">CURRENT_DESKTOP</span>=<span style="color: #fa8072;">`wmctrl -d|grep '*'|awk '{print $1}'`</span>


<span style="color: #a1db00;">if</span> [ $<span style="color: #ff8700;">#</span> != 1 ];<span style="color: #a1db00;">then</span>
    <span style="color: #d18aff;">echo</span> <span style="color: #ff4ea3;">"usage pwmctrl emacs.Emacs"</span>
    <span style="color: #a1db00;">exit</span> 1
<span style="color: #a1db00;">fi</span> 

<span style="color: #ff8700;">NAME</span>=$<span style="color: #ff8700;">1</span>

wmctrl -xlG | awk -v <span style="color: #ff8700;">W</span>=<span style="color: #ff4ea3;">"$SCREEN_W"</span> -v <span style="color: #ff8700;">H</span>=<span style="color: #ff4ea3;">"$SCREEN_H"</span> -v <span style="color: #ff8700;">NAME</span>=<span style="color: #ff4ea3;">"$NAME"</span> -v <span style="color: #ff8700;">CURRENT_DESKTOP</span>=<span style="color: #ff4ea3;">"$CURRENT_DESKTOP"</span> <span style="color: #ff4ea3;">'$7==NAME &amp;&amp; $3&gt;=0 &amp;&amp; $3&lt;W &amp;&amp; $4&gt;=0 &amp;&amp; $4&lt;H &amp;&amp; $2==CURRENT_DESKTOP {print $1}'</span> | <span style="color: #a1db00;">while </span><span style="color: #d18aff;">read</span> WINS; <span style="color: #a1db00;">do</span> wmctrl -ia <span style="color: #ff4ea3;">"$WINS"</span>; <span style="color: #a1db00;">done</span> 

<span style="color: #a1db00;">exit</span> 0
</pre>
</div>

<p>
要理解上面脚本，先得搞清楚 <code>wmctrl -xlg</code> 输出的每行的内容：
</p>
<pre class="example">
0x0120013a  0 0    0    1600 900  emacs.Emacs           pengpengxp-thinkpad emacs@pengpengxp-thinkpad
</pre>

<p>
我理解如下：
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">0x0120013a</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1600</td>
<td class="org-right">900</td>
<td class="org-left">emacs.Emacs</td>
<td class="org-left">pengpengxp-thinkpad emacs@pengpengxp-thinkpad</td>
</tr>

<tr>
<td class="org-right">唯一标识id</td>
<td class="org-right">虚拟桌面号</td>
<td class="org-right">N/A</td>
<td class="org-right">N/A</td>
<td class="org-right">宽度</td>
<td class="org-right">长度</td>
<td class="org-left">WM_CLASS，可以匹分应用程序</td>
<td class="org-left">窗口的title</td>
</tr>
</tbody>
</table>

<p>
可以使用 <code>wmctrl -d</code> 找到当前桌面号（带星号的一行）。
</p>

<p>
上面的脚本就是输入一个WM_CLASS，然后找到窗口的最大长度和宽度以及当前
桌面号。通过awk判断是当前桌面，且宽度和长度都没有超过当前屏幕时，才
切换窗口。
</p>

<p>
把上述脚本放到 <code>/yourpath/pwmctrl</code> 目录后，选择合适的按键绑到这些内
容就可以了：
</p>
<pre class="example">
/yourpath/pwmctrl emacs.Emacs
/yourpath/pwmctrl lilyterm.Lilyterm
/yourpath/pwmctrl Telegram.TelegramDesktop
/yourpath/pwmctrl google-chrome.Google-chrome
/yourpath/pwmctrl Opera.Opera
/yourpath/pwmctrl Navigator.Firefox-esr
</pre>

<p>
这样就只在当前桌面切换啦。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>